zup/ЗУП_бюджет/src/InformationRegisters/СвойстваДолжностейГосударственнойСлужбы/СвойстваДолжностейГосударственнойСлужбы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваДолжностейГосударственнойСлужбы</name>
  <resources>
    <name>ВидДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.ВидыДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.КатегорииДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.ГруппыДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДолжностьюГосударственнойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПомощникаЗамещающегоМуниципальнуюДолжность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПрокурора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДолжностьюВоеннойПравоохранительнойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьСудьи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПрокурораСледователяСудьи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсчислениеСтраховогоСтажаПФРГосударственнойДолжности</name>
    <type>
      <types>CatalogRef.ЗамещениеГосударственныхМуниципальныхДолжностейПФР</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/СвойстваДолжностейГосударственнойСлужбы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПараметрыОбновленияИсточникаПодключаемыхХарактеристикЗарплатаКадры(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ИмяРегистра = "СвойстваДолжностейГосударственнойСлужбы";
	ПараметрыОбновления.ИдентификаторИсточника = "ГосСлужба";
	ПараметрыОбновления.ИмяОбъекта = "Должность";
	ПараметрыОбновления.ИмяПланаВидовХарактеристик = Справочники.Должности.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры();
	
	НастройкиПрограммы = ЗарплатаКадрыРасширенный.НастройкиПрограммыБюджетногоУчреждения();
	Если НастройкиПрограммы.ИспользоватьГосударственнуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ВидДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("ГруппаДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("КатегорияДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("ДолжностьПрокурора");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьМуниципальнуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ВидДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("ГруппаДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("ДолжностьПомощникаЗамещающегоМуниципальнуюДолжность");
		ПараметрыОбновления.Реквизиты.Добавить("ДолжностьПрокурора");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьВоеннуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ВидДолжностиГосударственнойСлужбы");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьРасчетДенежногоСодержанияСудей Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ДолжностьСудьи");
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПараметрыОбновления.Реквизиты);
	
	Если ПараметрыОбновления.Реквизиты.Количество() = 0 Тогда
		ПараметрыОбновления.ИспользоватьХарактеристики = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
